# coding=utf8
import sqlite3

#Open database
conn = sqlite3.connect('database.db')
c=conn.cursor()
#Create table
c.execute('''create table book
        (         
            id INTEGER ,
            name char(50),
            author char(50),
            language char(50),
            publishing char(100),
            ISBN char(50) ,
            type char(50),
            picture char(100)
        );''')

c.execute("insert into book values (1, '用手帳偷看日本人的一年:翻開生活日語!', '本間岐理著', '中文', '日月文化出版 聯合發行總經銷', '978-986-248-489-0 ; 986-248-489-6', '日文學習', '1.jpg') ,(2, '泡沫人生', 'Boris Vian', '中文', '魔酒出版 遠足文化發行', '978-986-89745-0-0 ; 986-89745-0-X', '歐美文學', '2.jpg') ,(3, 'Java SE8 OCAJP專業認證指南:由初學邁向認證', '曾瑞君', '中文', '博碩文化', '978-986-434-398-0 ; 986-434-398-X', '程式設計', '3.jpg') ,(4, '20分鐘的奇蹟 最強英語聽力課:輕鬆搞定 TOEIC.TOEFL.IELTS.英檢.學測.會考:只需20分鐘即學即會!記憶深、難遺忘 瞬間掌握秘訣', '馬格.保羅基', '中文', '布可屋文化, 六六八企業出版 易可數位行銷總代理', '978-986-5544-13-3 ; 986-5544-13-X', '英文學習', '4.jpg') ,(5, '公平交易法:司法案例評析', '何之邁等合', '中文', '元照', '978-986-255-750-1 ; 986-255-750-8', '法律', '5.jpg') ,(6, 'New TOEIC 新制多益必考單詞1000', 'TEX加藤', '中文', '日月文化出版 聯合發行總經銷', '978-986-248-790-7 ; 986-248-790-9', '英文檢定', '6.jpg') ,(7, '全民英檢中級閱讀題庫解析:段落填空:地表最強閱讀測驗秘笈:出題方向、考試趨勢, 完全模擬、徹底掌握', '珊卓沃克, 張清芳合著', '中文', '布可屋文化, 六六八企業出版 易可數位行銷總代理', '978-957-9579-95-7 ; 957-9579-95-4', '英文檢定', '7.jpg') ,(8, '灰階思考', '謝孟恭', '中文', '天下文化', '978-986-525-120-8 ; 986-525-120-5 ; 978-986-525-121-5 ; 986-525-121-3 ; 978-986-525-102-4 ; 986-525-102-7', '投資理財保險', '8.jpg') ,(9, '被討厭的勇氣:自我啟發之父「阿德勒」的教導', '岸見一郎, 古賀史健', '中文', '究竟', '978-986-137-195-5 ; 986-137-195-8', '成長勵志', '9.jpg') ,(10, '看美劇, 說出一口好英文:一天30分鐘+高效筆記術 訓練用英文思考的大腦, 從聽說讀寫提昇英語實力!', '出口武賴著;山崎達也插畫', '中文', '日月文化出版 聯合發行總經銷', '978-986-248-862-1 ; 986-248-862-X', '英文學習', '10.jpg') ,(11, '原來, 什麼事都跟心理學有關:懂得心理學, 才可以做出最好的選擇!', '王琳', '中文', '海鷹文化企劃出版 知遠文化總經銷', '978-986-392-315-2 ; 986-392-315-X', '心理學', '11.jpg') ,(12, '高分.暢銷10000單字搞定新日檢:N1.N2.N3.N4.N5必考單字', '田中紀子, 杉本愛子合著', '中文', '布可屋文化, 六六八企業出版 易可數位行銷總代理', '978-957-9579-61-2 ; 957-9579-61-X', '日語檢定', '12.jpg') ,(13, '新制多益聽力滿分:神準5回全真試題+解題策略', '韋爾', '中文', '倍斯特', '978-986-98079-4-4 ; 986-98079-4-1', '英文檢定', '13.jpg') ,(14, '為什麼要睡覺?:睡出健康與學習力、夢出創意的新科學', 'Matthew Walker', '中文', '遠見天下文化', '978-986-479-631-1 ; 986-479-631-3', '科學總論', '14.jpg') ,(15, '老師解題 民法總則', '苗星(施宇宸)', '中文', '新保成', '978-986-481-778-8 ; 986-481-778-7', '高普特考', '15.jpg') ,(16, '可以馬上學會的超強英語閱讀課:最有效率的閱讀訓練法破解閱讀密碼、突破瓶頸:一次搞定:TOEIC.TOEFL.IELTS.英檢.學測.會考', '蘇盈盈, 珊朵拉合著', '中文', '哈福出版 采舍國際總代理', '978-986-99161-5-8 ; 986-99161-5-5', '英文學習', '16.jpg') ,(17, '房思琪的初戀樂園', '林奕含', '中文', '游擊文化出版 前衛總經銷', '978-986-92364-7-8 ; 986-92364-7-2', '中文現代文學', '17.jpg') ,(18, '原子習慣:細微改變帶來巨大成就的實證法則', 'James Clear', '中文', '方智', '978-986-175-526-7 ; 986-175-526-8', '成長勵志', '18.jpg') ,(19, '我還是會繼續釀梅子酒', '張西', '中文', '三采文化', '978-957-658-269-1 ; 957-658-269-5', '中文現代文學', '19.jpg') ,(20, '有一種分手叫不遺憾:練習停止內耗, 走出不安和失控, 戀愛需要理解彼此、成全自己', 'AWE情感工作室, 文飛(Dana)', '中文', '時報文化', '978-957-13-8225-8 ; 957-13-8225-6', '兩性婚姻愛情', '20.jpg') ")
conn.commit()

c.execute('''create table comment
        (      
            commentId INTEGER PRIMARY KEY AUTOINCREMENT,  
            bookId INTEGER ,
            name char(50),
            message char(50),
            time char(50)
        );''')
c.execute("insert into comment values (1, 1, '1', '123你好美','2020/8/4 下午10:26:28'), (2, 2, '2', '234你好', '2020/6/5 下午10:26:28'), (3, 2, '3', '234你好', '2020/6/8 下午10:26:28')")
conn.commit()

c.execute('''CREATE TABLE users
		(userId INTEGER PRIMARY KEY AUTOINCREMENT,
		email char(255),
        name char(255),
    	password char(255)
		);''')


conn.close()